label start:
    play music "audio/spooky_music_bg.mp3" volume 0.1
    scene bg104

    voice "audio/voices/main/main.mp3"
    "{i}Зимой 1927/28 года агенты федерального правительства произвели секретное расследование в старинном портовом городке Инсмут, штат Массачусетс.{/i}"

    voice "audio/voices/main/main1.mp3"
    "{i}Общественность впервые узнала об этом в феврале, когда прокатилась большая волна облав и арестов.{/i}"

    voice "audio/voices/main/main2.mp3"
    "{i}после которой сожгли и взорвали – с известными,
    конечно, предосторожн остями – огромное количество ветхих, изъеденных червями и, как все полагали, давно покинутых зданий близ опустевшего порта.{/i}"

    voice "audio/voices/main/main3.mp3"
    "{i}Нелюбопытные души сочли все это одним из главных сражений в судорожной войне с бутлегерством.{/i}"

    scene bg106
    voice "audio/voices/main/main4.mp3"
    "{i}Но люди, жадные до сенсаций, не переставали дивиться невероятному обилию арестов,{/i}"
    
    voice "audio/voices/main/main5.mp3"
    "{i}колоссальному числу полицейских и военнослужащих, брошенных на это дело, и засекреченности данных о местонахождении узников.{/i}"
    
    voice "audio/voices/main/main6.mp3"
    "{i}Причем отсутствовали не только сообщения о судебных разбирательствах или хотя бы о конкретных обвинениях,{/i}"
    
    voice "audio/voices/main/main7.mp3"
    "{i}но и какая‑либо информация о пребывании задержанных в обычных тюрьмах.{/i}"
    
    voice "audio/voices/main/main8.mp3"
    "{i}Строились смутные догадки насчет инфекционных бараков и концентрационных лагерей,{/i}"
    
    voice "audio/voices/main/main9.mp3"
    "{i}а позже – о рассредоточении арестантов по военно‑морским и армейским тюрьмам, но ничего определенного никто сказать не мог.{/i}"
    
    voice "audio/voices/main/main10.mp3"
    "{i}Инсмут тогда почти обезлюдел и только теперь начинает подавать признаки медленного возвращения к жизни.{/i}"

    scene bg105

    voice "audio/voices/main/main11.mp3"
    "{i}Недовольство либеральных организаций власти нейтрализовали долгими конфиденциальными собеседованиями,{/i}"
    
    voice "audio/voices/main/main12.mp3"
    "{i}а их представителей допустили в некоторые лагеря и тюрьмы. В результате эти организации стали на удивление пассивны и сдержанны.{/i}"
    
    voice "audio/voices/main/main13.mp3"
    "{i}Газетчики проявили большую настойчивость, но и они в конце концов поддались на уговоры властей.{/i}"
    
    voice "audio/voices/main/main14.mp3"
    "{i}Только одна газета – но уж таковы бульварные газеты с их неуемным азартом – разродилась сообщением о некоей подводной лодке,{/i}"
    
    voice "audio/voices/main/main15.mp3"
    "{i}выпустившей торпеды в морскую пучину за Чертовым рифом.{/i}"
    
    voice "audio/voices/main/main16.mp3"
    "{i}Но эта сенсация, основанная на слухах из портовых притонов, выглядела слишком уж притянутой за уши,{/i}"
    
    voice "audio/voices/main/main17.mp3"
    "{i}тем более что упомянутый риф расположен в добрых полутора милях от собственно Инсмута.{/i}"

    scene bg103

    voice "audio/voices/main/main18.mp3"
    "{i}Даже в соседних городках люди, обсуждая эти события, старались поменьше сообщать о них внешнему миру.{/i}"
    
    voice "audio/voices/main/main19.mp3"
    "{i}Пересуды о вымирающем и почти заброшенном Инсмуте велись уже чуть ли не столетие, и сейчас, в сущности, не произошло ничего нового,{/i}"
    
    voice "audio/voices/main/main20.mp3"
    "{i}более дикого и отвратительного, нежели то, о чем говорилось в прошлые годы. У местных жителей было много причин хранить молчание,{/i}"
    
    voice "audio/voices/main/main21.mp3"
    "{i}так что властям не пришлось особо давить на них, призывая к сдержанности. К тому же они мало что знали на самом деле;{/i}"
    
    voice "audio/voices/main/main22.mp3"
    "{i}из‑за обширных, пустынных и безлюдных низин, затопляемых во время прилива, добрососедских отношений с жителями Инсмута у них никогда не водилось.{/i}"

    scene bg16

    voice "audio/voices/main/main23.mp3"
    "{i}Но я в конце концов решил прервать заговор молчания, связанный с этими событиями.{/i}"
    
    voice "audio/voices/main/main24.mp3"
    " {i}Результаты, я уверен, не принесут большого вреда – разве что шок отвращения, когда общественность узнает,{/i}"
    
    voice "audio/voices/main/main25.mp3"
    "{i} что именно было обнаружено в Инсмуте потрясенными участниками тех полицейских операций.{/i} "
    
    voice "audio/voices/main/main26.mp3"
    "{i}В то же время вскрытые факты могут иметь очень разные объяснения. Мне и самому известна только часть этой истории,{/i}"
    
    voice "audio/voices/main/main27.mp3"
    "{i} но у меня достаточно причин не влезать в расследование еще глубже. Моя связь с этим делом и так оказалась более чем тесной,{/i}"
    
    voice "audio/voices/main/main28.mp3"
    "{i} и полученные тогда впечатления еще отразятся – причем самым радикальным образом – на моем будущем.{/i}"






label chapter_1:
   
    define n = Character(None, kind=nvl, window_left_padding=-100, window_yoffset=40)

    scene bg3

    voice "audio/voices/main/main29.mp3"
    "{i}Собственно, это не кто иной, как я, охваченный безумным ужасом, бежал из Инсмута в ранние утренние часы шестнадцатого июля 1927 года,{/i}"
    
    voice "audio/voices/main/main30.mp3"
    "{i} и это именно мой панический призыв к властям произвести расследование дал толчок последующим событиям.{/i}"
    
    voice "audio/voices/main/main31.mp3"
    "{i} Я не хотел прерывать молчание, пока дело было свежо в памяти его непосредственных участников;{/i}"
    
    voice "audio/voices/main/main32.mp3"
    "{i} но теперь, когда к этой старой истории уже утрачен интерес любознательной публики,{/i}"
    
    voice "audio/voices/main/main33.mp3"
    "{i} во мне растет желание поведать об ужасающих часах, что я провел в том издавна пользующемся дурной славой морском порту,{/i}"
    
    voice "audio/voices/main/main34.mp3"
    "{i} в логове гибельных и богопротивных пороков. Надеюсь, этот рассказ поможет мне самому поверить в то,{/i}"
    
    voice "audio/voices/main/main35.mp3"
    "{i} что я еще в своем уме и что я не оказался всего‑навсего жертвой кошмарных галлюцинаций. {/i}"
    scene bg4

    voice "audio/voices/main/main36.mp3"
    "{i}Это также поможет мне собраться с духом перед ужасным шагом, который мне вскорости предстоит совершить. {/i}"
    
    voice "audio/voices/main/main37.mp3"
    "{i}О существовании Инсмута я узнал за день до того, как увидел его в первый и – на данный момент – последний раз.{/i}"
    
    voice "audio/voices/main/main38.mp3"
    "{i} Решив отметить предстоящее совершеннолетие путешествием по Новой Англии – полюбоваться природой, {/i}"
    
    voice "audio/voices/main/main39.mp3"
    "{i}стариной и заодно выяснить кое‑что по части собственной генеалогии, – я планировал добраться из старинного Ньюберипорта до Аркхема, откуда происходил род моей матери.{/i}"
    
    voice "audio/voices/main/main40.mp3"
    "{i} Не имея машины, я путешествовал поездом либо автобусом, стараясь по возможности экономить на дорожных расходах.{/i}"
    
    voice "audio/voices/main/main41.mp3"
    "{i} Как сейчас помню начало этой истории, которая навсегда перевернула мою жизнь...{/i}"

    play music "audio/chapter_1.mp3" volume 0.1
    define i = Character("Кассир", color="#0B888E")

    scene bg5
    image insm_7 = im.Scale("insm_7.png", 1080 / 1.6, 1920 / 1.6)
    image insm_7_1 = im.Scale("insm_7_1.png", 1080 / 1.6, 1920 / 1.6)
    show insm_7 at center
    voice "audio/voices/main/main42.mp3"
    i "{i}Есть тут один дряхлый автобус. Он, правда, делает крюк, заезжая в Инсмут – вы, может, слышали о нем, – так что людям это не нравится.{/i}"
    
    voice "audio/voices/main/main43.mp3"
    i"{i} Водит его инсмутский малый по имени Джо Сарджент, и пассажиров у него всегда негусто – что здесь, что в Аркхеме.{/i}"
    
    voice "audio/voices/main/main44.mp3"
    i"{i} Удивляюсь, как вообще люди решаются ездить на этаком тарантасе. Однако проезд стоит недорого, хоть я никогда не видал, чтобы кто‑то, кроме инсмутских жителей, им пользовался.{/i}"
    
    voice "audio/voices/main/main45.mp3"
    i"{i} Он отходит с площади – остановка напротив аптеки Хаммонда – дважды в день: в десять утра и семь вечера, если только ничего не изменилось в последнее время.{/i}"
    
    voice "audio/voices/main/main46.mp3"
    i"{i} Впрочем, я бы на вашем месте не рискнул садиться в эту жуткую развалюху.{/i}"

    scene bg6
    voice "audio/voices/main/main47.mp3"
    n '{i}Это было первое, что я узнал о помраченном Инсмуте. Подобная справка о городе, не обозначенном на обычных картах{/i}'
    
    voice "audio/voices/main/main48.mp3"
    n '{i}и не упоминаемом в современных путеводителях, как и отдельные намеки в рассказе кассира возбудили мое любопытство.{/i}'
    
    voice "audio/voices/main/main49.mp3"
    n '{i}Город, способный внушить соседям такую неприязнь, подумал я, на самом деле может оказаться гораздо более примечательным{/i}'
    
    voice "audio/voices/main/main50.mp3"
    n '{i}и вполне достойным внимания туриста. Если он расположен по пути в Аркхем, я должен его посетить{/i}'

    scene bg72

    voice "audio/voices/main/main51.mp3"
    "{i}Есть тут один дряхлый автобус. Он, правда, делает крюк, заезжая в Инсмут – вы, может, слышали о нем, – так что людям это не нравится.{/i}"

    scene bg5
    show insm_7_1 at center

    voice "audio/voices/main/main52.mp3"
    i"{i}Инсмут? Ну, это захолустный такой городишко в устье Мануксета.{/i}"
    
    voice "audio/voices/main/main53.mp3"
    i "{i}Было время, когда он что‑то собой представлял – до войны тысяча восемьсот двенадцатого там был порт, – но за последнюю сотню лет он превратился в труху, разваливается на глазах. {/i}"
    
    voice "audio/voices/main/main54.mp3"
    i "{i}Теперь туда и поезда не ходят – «Бостон‑Мэн» и прежде проходил стороной, а несколько лет назад закрыли и ветку из Ровлея.{/i}"

    show insm_7 at center

    voice "audio/voices/main/main55.mp3"
    i "{i}Там, я думаю, пустых домов больше, чем людей, да и занятий никаких нет, разве что рыбу ловят да омаров.{/i}"
    
    voice "audio/voices/main/main56.mp3"
    i "{i} Торгуют в большинстве здесь, еще в Аркхеме да Ипсвиче. Когда‑то у них было несколько мельниц, но ничего не осталось,{/i}"
    
    voice "audio/voices/main/main57.mp3"
    i "{i} кроме одного золотоплавильного заводика, да и тот нынче на ладан дышит.{/i}"
    
    voice "audio/voices/main/main58.mp3"
    i "{i} А в свое время завод, скажу я вам, без дела не стоял, и старик Марш, его владелец, будет побогаче Креза.{/i}"
    
    voice "audio/voices/main/main59.mp3"
    i "{i} Странный тип, однако, хоть и слывет крупной шишкой среди своих. Но у него не то кожная болезнь, не то уродство какое, появившееся недавно, так что на глаза людям не показывается. {/i}"
    
    voice "audio/voices/main/main60.mp3"
    i "{i}Он внук капитана Оубеда Марша, основателя дела. Его мать вроде была иностранкой – говорили, откуда‑то с островов южных морей, – так что большой был скандал,{/i}"
    
    voice "audio/voices/main/main61.mp3"
    i "{i} когда он пятнадцать лет назад женился на девушке из Ипсвича. Здесь это не приветствуют – и горожане, и люди из окрестностей стараются скрыть инсмутскую кровь, если та течет в их жилах.{/i}"
    
    voice "audio/voices/main/main62.mp3"
    i "{i} Но дети и внуки Марша выглядели совсем нормально, насколько я могу судить. Мне их как‑то показывали, однако потом старшие из детей здесь уже не появлялись. {/i}"
    
    voice "audio/voices/main/main63.mp3"
    i "{i} А вот старика того и вообще никогда не видел.{/i}"

    scene bg63

    voice "audio/voices/main/main64.mp3"
    "{i}Спросите, почему все так пренебрегают Инсмутом? Ну, молодой человек, вы не ошибетесь, если поверите тому, о чем говорят здесь повсюду.{/i}"
    
    voice "audio/voices/main/main65.mp3"
    "{i} Дыма без огня не бывает – уж если народ поговаривает, это неспроста. Люди болтают об Инсмуте – шепотом по большей части – уже чуть не сто лет, вот я и думаю, все потому,{/i}"
    
    voice "audio/voices/main/main66.mp3"
    "{i} что инсмутцы отвратительнее кого бы то ни было в этих местах. {/i}"
    
    "{i}Некоторые сплетни рассмешили бы вас – насчет, например, старого капитана Марша: вроде он заключил сделку с дьяволом и поставлял из ада чертенят,{/i}"
    "{i} чтобы жили в Инсмуте, или о чем‑то вроде сатанинского культа и жутких жертвоприношениях в одном местечке близ пристаней – это будто бы происходило году в тысяча восемьсот сорок пятом или около того; {/i}"
    "{i}но я прибыл сюда из Пэнтона, штат Вермонт, и такого рода россказням веры не даю.{/i}"

    scene bg71

    "{i}Вы, может, еще услышите, что тут со стародавних времен болтают о черном рифе у побережья – они называют его Чертовым рифом.{/i}"
    "{i} Большую часть времени он торчит над водой, а в прилив если и скрывается, то самую малость, но все же островом его не назовешь.{/i}"
    "{i} Говорят, что там, на этом рифе, показывается иногда целый легион чертей, расползающихся повсюду и снующих туда‑сюда через какие‑то дыры вроде пещер возле верхушки. {/i}"
    "{i}Эта зазубренная штуковина торчит в миле с лишним от берега, и моряки обычно делают большой крюк, чтобы его обогнуть.{/i}"

    scene bg64

    "{i}Я говорю о моряках, которые родом не из Инсмута. Они крепко невзлюбили старого капитана Марша за то, что он будто бы иногда высаживался на рифе по ночам, во время отлива.{/i}"
    "{i} Может, оно и верно – место это уединенное, так что он мог выискивать там старый пиратский клад, а то и нашел его; но ходили еще слухи, что он якшается там с демонами.{/i}"
    "{i} Слухи слухами, однако я полагаю, что риф обрел дурную славу именно из‑за старого капитана.{/i}"

    scene bg5
    show insm_7 at center

    i "{i}Но это было еще до большой эпидемии тысяча восемьсот сорок шестого года, когда в Инсмуте перемерла половина народу.{/i}"
    i "{i}Они так и не выяснили, откуда взялась зараза – скорее всего, ее занесли на кораблях из Китая или иных дальних мест.{/i}"
    i "{i} Можно представить, что там творилось, – бунты, беспорядки и всякие ужасы, но, насколько я знаю, города никто не покидал,{i}"
    i "{i} зато сам город остался в страшном виде, да и живет там теперь не больше трех‑четырех сотен человек.{/i}"
    i "{i}Но главное, люди по всей округе испытывают к ним что‑то типа расовой ненависти – и я их не осуждаю.{/i}"

    scene bg5
    show insm_7_1 at center
    i "{i} Я и сам терпеть не могу этот инсмутский народец и не имею ни малейшего желания посетить их городишко.{/i}"
    i "{i} Полагаю, вам известно – хотя, по говору судя, вы с Запада, – что много кораблей из Новой Англии ходило в подозрительные порты Африки, Азии, южных морей и черт знает куда еще, а возвращаясь,{/i}"
    i "{i}они привозили всякого рода сомнительных пассажиров. Может, вы слышали насчет человека из Салема, вернувшегося домой с женой‑китаянкой, а в районе Кейп‑Кода, говорят, до сих пор живут выходцы с островов Фиджи.{/i}"

    scene bg5
    show insm_7 at center

    i "{i}Вот и с этими инсмутцами дело нечисто, можете мне поверить. Место всегда было плохое, отрезанное болотами, заливами и устьем реки, так какая у нас может быть уверенность насчет всех их ходов‑выходов и разных {/i}"
    i "{i}там делишек? Но все знают, что старый капитан Марш годах в двадцатых или тридцатых – прошлого века, разумеется, – когда все три его судна еще были на плаву, как‑то привез невесть откуда мерзкого вида дикарей.{/i}"
    i "{i} Да уж, есть в этих инсмутцах какая‑то дурная примесь, – не знаю, чем и объяснить, но это сразу чувствуется.{/i}"
    i "{i}Если вы сядете в автобус Джо Сарджента, то по одному виду водителя многое поймете о тамошней публике.{/i}"

    scene bg5
    show insm_7_1 at center

    i "{i}У большинства из них необычно сплюснутые головы с плоскими носами и выпученными глазами, которых они никогда вроде и не закрывают, да и про кожу их не скажешь, что она больно чиста.{/i}"
    i "{i}Грубая и будто запаршивевшая, а шеи какие‑то сморщенные и все в складках. Плешивых много, даже среди молодежи. Кто постарше выглядят и того хуже, а настоящих стариков из Инсмута я не видал вовсе.{/i}"
    i "{i} Небось, мрут как мухи, глядя в стакан. Животные тоже их ненавидят: с лошадьми у них вечно были проблемы, покуда не появились автомобили.{/i}"
    i "{i}Никто вокруг – возьмите хоть Аркхем, хоть Ипсвич – не хочет иметь с ними дел, а они сами держатся нелюдимо – и когда сюда, в город, приходят, и когда кто‑нибудь пытается ловить рыбу у их берега.{/i}"

    scene bg49

    "{i}Вообще, странно, рыбы там всегда навалом, хотя ни у нас, ни в других местах поблизости ее не видать, – но только попробуйте порыбачить там и сами увидите, как эти людишки погонят вас оттуда.{/i}"
    "{i} Прежде они добирались сюда поездом, а как ветку до станции Ровлей закрыли, стали ездить на этом автобусе.{/i}"

    scene bg16

    "{i}Да, кстати, у них, в Инсмуте, есть отель – называется «Гилмэн‑хаус», – но я бы не посоветовал там останавливаться. Лучше заночевать здесь, а уж завтра утречком десятичасовым автобусом и поехать;{/i}"
    "{i} тогда вечерним восьмичасовым сможете двинуть оттуда дальше до Аркхема. Не то было дело пару лет назад: отправился туда инспектор по фабричным делам, ну и остановился в «Гилмэн‑хаусе»,{/i}"
    "{i} а потом как только не клял эту дыру. Будто бы их понабилось туда великое множество, так что в его комнату со всех сторон доносились голоса – хотя большинство номеров пустовало – и он всю ночь трясся от страха. {/i}"
    "{i}Какие‑то непонятные разговоры, будто на чужих языках, но больше всего его напугал один голос, который раздавался время от времени. Он звучал так ненатурально – будто мокрый какой‑то,{/i}"
    "{i}  – так что этот несчастный инспектор побоялся даже раздеться, так и улегся в чем был. Но и не спал совсем, только знай дожидался, когда первый утренний свет забрезжит. А разговоры эти велись у них чуть не всю ночь.{/i}"
    "{i}Инспектор этот – Кэзи его звали – много чего порассказал: мол, эти инсмутцы следили за ним, вроде как стражу приставили. А заводик Марша нашел он в странном месте – на старой мельнице, у нижних плотин Мануксета. {/i}"
    "{i}Ну что он рассказывал, то я и раньше слыхал. В бухгалтерии там неразбериха, учет сделок толком не ведется. И концов не найти, откуда эти Марши берут золото для очистки и переплавки. {/i}"
    "{i}Больших закупок они вроде никогда не делали, но в былые годы вывозили чертову уйму готовых слитков. Доходили слухи о странных, нездешнего вида драгоценностях, их иногда тайком продавали моряки и фабричные,{/i}"
    "{i}да и на женщинах из семьи Маршей их пару‑тройку раз видели. Люди допускают, что старый капитан Оубед обменял это в каком‑нибудь языческом порту, тем более что он в те времена мешками заказывал стеклянные бусы и безделки,{/i}"
    "{i} какими мореходы запасались для туземной торговли. А некоторые до сих пор считают, что он нашел возле Чертова рифа пиратский клад. Но вот странная штука.{/i}"
    "{i}Старый капитан уже лет шестьдесят тому как помер, а после Гражданской войны у них там и приличных морских судов не осталось,{/i}"

    scene bg5
    show insm_7_1 at center

    i "{i}но Марши по‑прежнему знай себе закупают этот обменный туземный товар – всякие стеклянные и каучуковые безделки. Может, инсмутская шваль берет их для себя?{/i}"
    i "{i} Сами‑то они не шибко далеко ушли от каннибалов южных морей и дикарей Гвинеи.{/i}"
    i "{i}Бедствие сорок шестого забрало, надо думать, из тех мест лучшую кровь. Как ни крути, а выглядят они жутко, что Марши, что другие тамошние богачи.{/i}"
    i "{i} Я говорил, там в городе осталось теперь не больше четырех сотен людей, и домов полно пустых. На Юге таких называют «белым отребьем», – беззаконные и грешные, вечно со своими темными делишками.{/i}"
    i "{i} Они добывают уйму рыбы и омаров и грузовиками вывозят все это на продажу. Подозрительно все же, как это так выходит, что рыба кишмя кишит только у них, а больше нигде.{/i}"
    show insm_7 at center
    i "{i}Никто за ними уследить не может – ни школьные инспекторы, ни те, что уже черт знает сколько времени проводят перепись населения. Можно пари держать, что любопытным туристам тоже не слишком рады в Инсмуте.{/i}"
    i "{i} Я слыхал, там без следа пропали несколько заезжих бизнесменов и чиновников, а один будто бы сошел с ума и теперь, бедняга, лечится в Денверсе. Да уж, эти могут нагнать страху на кого угодно.{/i}"
    i "{i}Вот потому я и не советую ехать в Инсмут с ночевкой. Сам‑то я никогда там не бывал и не горю желанием побывать, но, думаю, дневная поездка вреда не причинит – хотя здешние люди и будут отговаривать вас от этого.{/i}"
    i"{i} Если же вы любитель всякого древнего старья, так для вас Инсмут – как раз то, что надо.{/i}"




label library:

    scene bg6

    n '{i}После того разговора с кассиром я потратил часть вечера на посещение Ньюберипортской публичной библиотеки, чтобы пополнить сведения об Инсмуте.{/i}'
    n '{i}Когда я пытался расспрашивать местных жителей в магазинах и закусочных, в гараже и пожарном депо, они реагировали еще менее дружелюбно,{/i}'
    n '{i}чем предупреждал меня билетный кассир; и я решил не тратить зря времени на попытки их разговорить.{/i}'

    scene bg7

    "{i}Справочник по истории округа Эссекс, найденный мною на полках библиотеки, сообщал о городе немного: основан он был в 1643 году, в колониальную эпоху там процветало судостроение,{/i}"
    "{i}а в начале девятнадцатого века – мореходство; позднее он был известен как незначительный промышленный центр, использующий энергию реки Мануксет.{/i}"
    "{i}Эпидемия и мятежи 1846 года были упомянуты вскользь, ибо они плохо вписывались в славную историю этого округа.{/i}"
    "{i}Зато немногие записи, свидетельствовавшие об упадке города, не подлежали сомнению. После Гражданской войны вся индустриальная жизнь сосредоточилась в руках «Марш рефайнинг компани»,{/i}"
    "{i}а торговля золотыми слитками составляла единственный местный источник дохода помимо исконного занятия рыболовством, которое становилось все менее прибыльным,{/i}"
    "{i}поскольку крупные корпорации навязывали конкуренцию и цена товара падала, при том что рыбные промыслы близ Инсмута никогда не оскудевали.{/i}"
    "{i}Иностранцы редко там приживались, доказательством чему мог служить осторожный намек на историю с изгнанием попытавшихся было осесть в тех местах поляков и португальцев.{/i}"

    scene bg8

    "{i}Более всего заинтересовали меня упоминания о необычных драгоценностях, которые так или иначе ассоциировались с Инсмутом.{/i}"
    "{i}Это, похоже, были далеко не заурядные изделия, ибо некоторые из них хранились в Мискатоникском университете Аркхема и выставочном зале Исторического общества Ньюберипорта.{/i}"
    "{i}Описания этих вещей, весьма прозаичные и фрагментарные, в то же время содержали намек на нечто таинственное.{/i}"
    "{i}Я был заинтригован и, несмотря на поздний час, решил, если удастся, посмотреть на местную достопримечательность – нечто вроде крупной тиары необычной формы.{/i}"
    "{i}Библиотекарь написал записку, рекомендующую меня хранительнице музея Исторического общества мисс Анне Тилтон, живущей поблизости, и почтенная леди любезно открыла ради меня выставочный зал,{/i}"
    "{i}благо время было еще не такое уж позднее.{/i}"

    scene bg9

    "{i}Коллекция, воистину незаурядная, все же не привлекла моего внимания, ибо им полностью завладел сияющий в электрическом свете причудливый предмет в угловой витрине.{/i}"
    "{i}Я не великий знаток и поклонник красоты, но странное, фантастическое великолепие неведомого шедевра, покоящегося на бархатной пурпурной подушке, заставило меня буквально задохнуться от изумления.{/i}"
    "{i}Вскоре я обнаружил, что неясная тревога, вызываемая во мне этой вещью, имела второй и, возможно, не менее сильный источник в изобразительной и математической многозначности странных орнаментов.{/i}"
    "{i}Все эти узоры намекали на некие тайны и невообразимые бездны времени и пространства, а повторяющиеся морские элементы рельефов казались почти зловещими.{/i}"

    scene bg10

    "{i}Мисс Тилтон так же поведала и о возникновении данной тиары в местном хранилище. Эту вещь в 1873 году за смехотворно низкую цену оставил под залог в лавке на Стейт‑стрит какой‑то пьянчужка из Инсмута,{/i}"
    "{i}вскоре убитый в уличной потасовке. Историческое общество приобрело предмет непосредственно у ростовщика и сразу нашло ей почетное место в музейной витрине.{/i}"
    "{i}Сопроводительная надпись допускала вероятность вест‑индского или индокитайского происхождения экспоната, хотя четкого мнения на сей счет у специалистов не было.{/i}"




label trip:
    scene bg11

    "{i}Незадолго до десяти утра я с небольшим саквояжем стоял на старой торговой площади, прямо перед аптекой Хаммонда, в ожидании инсмутского автобуса.{/i}"
    "{i}Когда подошло время его прибытия, я заметил общее стремление праздношатающихся горожан перейти на другую сторону улицы.{/i}"
    "{i}Видно, билетный кассир не сильно преувеличивал, говоря о нелюбви местных жителей к Инсмуту и его обитателям.{/i}"
    "{i}Через несколько минут в конце Стейт‑стрит появился маленький автобус – дряхлый, непрезентабельный и серый от дорожной пыли – и, сделав круг по площади, с большим шумом притормозил у остановки.{/i}"
    "{i}Я сразу же почувствовал, что это именно он и есть, убедившись в этом чуть погодя, когда заметил на переднем стекле табличку с полустершейся надписью: «Аркхем – Инсмут – Ньюб’порт».{/i}"

    image insm_2 = im.Scale("insm_2.png", 1080 / 1.6, 1920 / 1.6)
    show insm_2 at center
    "{i}Это, должно быть, и есть Джо Сарджент, упомянутый билетным кассиром; и еще до того, как я успел рассмотреть детали, меня вдруг окатила волна неприязни, столь же непреодолимой, сколь и необъяснимой.{/i}"
    "{i}Поведение местных людей, отхлынувших от остановки, вполне естественно: они не желали соприкасаться ни с этим автобусом, ни с человеком, владеющим и управляющим им,{/i}"
    "{i}ни с чем бы то ни было связанным с местами его обитания и его сородичами. Очевидно, долгое пребывание возле рыбных промыслов наделило его характерным запахом.{/i}"
    "{i}А уж какая кровь текла в его жилах, определить я так и не смог. Вряд ли в нем можно было найти черты азиата, полинезийца, левантинца или негроида, однако люди принимали его за чужака.{/i}"

    define n = Character(None, kind=nvl, window_left_padding=-100, window_yoffset=40)

    scene bg6

    n "{i}Я уселся подальше от него, но на той же стороне салона, откуда во время поездки было удобнее обозревать берег.{/i}"
    n "{i}Наконец дряхлый транспорт, покряхтев, тронулся с места, выпустил облако отработанного газа и шумно двинулся мимо старых зданий Стейт‑стрит.{/i}"

    hide text

    scene bg15

    "{i}День стоял солнечный, теплый, но песчаный ландшафт, украшенный лишь зарослями осоки и низкорослым кустарником, по мере нашего продвижения становился все более унылым.{/i}"
    "{i}Время от времени мы переезжали грубой постройки деревянные мосты над бухточками, образованными приливом или рукавами речного устья и отрезавшими эту местность от окружающего региона.{/i}"

    scene bg12

    "{i}Но вот наконец мы миновали островок Плюм‑Айленд, и слева раскинулся широкий вид на Атлантику.{/i}"
    "{i}Дорога пошла в крутой подъем, и я забеспокоился, глядя на длинный гребень впереди, где наш путь с четко врезанными колеями как будто встречался с небом.{/i}"

    scene bg14

    "{i}Казалось, что автобус, преодолев эту крутизну, навсегда покидает землю, чтобы слиться с неведомой тайной вышнего воздуха и сокровенных небес.{/i}"
    "{i}Запах моря теперь казался зловещим, а молчаливо сутулящийся водитель, с его напряженной спиной и узкой головой, становился мне все более и более ненавистен.{/i}"

    scene bg13

    "{i}Но вот мы достигли гребня, и внизу открылась долина, где река Мануксет впадала в море чуть севернее протяженной линии скал и далее несла свои воды в сторону мыса Энн.{/i}"
    "{i}На горизонте маячила одинокая гора Кингсгюрт‑Хэд, увенчанная старинным домом, о котором так много говорят легенды; но все мое внимание в этот момент поглотила расстилающаяся внизу панорама.{/i}"
    "{i}Я догадался, что это и был всеми проклятый и презираемый Инсмут.{/i}"

    scene bg17

    "{i}При его широкой протяженности и плотной застройке город неприятно поражал отсутствием признаков жизни.{/i}"
    "{i}Над беспорядочно разбросанными трубами почти не виднелось клубов дыма.{/i}"
    "{i}Обширное пространство занимали беспорядочно разбросанные кровли, а фронтоны и коньки крыш даже издали выглядели насквозь прогнившими; когда же мы подъехали ближе к городу,{/i}"
    "{i}я увидел, что многие кровли целиком провалились внутрь зданий.{/i}"

    scene bg16

    "{i}Не избежали этой участи и несколько огромных квадратных домов георгианского стиля с куполами и высокими верандами.{/i}"
    "{i}Эти дома отстояли дальше от воды; один или два из них казались еще довольно крепкими.{/i}"
    "{i}Вглядываясь в просветы меж руинами, я заметил ржавые, заросшие травой рельсы бывшей железной дороги с покосившимися телеграфными столбами,{/i}"
    "{i}лишенными проводов, и едва заметные колеи старых дорог на Ипсвич и Ровлей.{/i}"

    scene bg18

    "{i}В наихудшем состоянии были дома вблизи береговой линии, среди которых по контрасту выделялась прекрасно сохранившаяся башня на здании кубической формы, напоминавшем небольшую фабрику.{/i}"
    "{i}Гавань, давно занесенная песком, была огорожена древним каменным молом; на нем я различил несколько крошечных фигурок рыбаков,{/i}"
    "{i}а на самом конце мола вырисовывалось что‑то вроде фундамента стоявшего там некогда маяка. Внутри этого рукотворного барьера сформировался песчаный язык,{/i}"
    "{i}и на нем я увидел несколько дряхлых хижин, деревянных рыбачьих плоскодонок и разбросанные повсюду верши для омаров.{/i}"
    "{i}Глубоководье вроде бы начиналось за тем местом, где река, огибая башенную конструкцию, разливалась и поворачивала на юг, впадая в океан у конца мола.{/i}"

    scene bg19

    "{i}По дороге мы никого не встретили, но вскоре за окнами автобуса потянулись заброшенные фермы в разных стадиях разрушения.{/i}"
    "{i}Затем я приметил несколько обитаемых домов с разбитыми окнами, заткнутыми тряпьем и всяким хламом, и дворами, усеянными ракушками и рыбьими костями.{/i}"

    scene bg20

    "{i}Автобус пересекал некое подобие площади, на противоположных концах которой стояли две церкви, а в центре возлежали замусоренные останки того, что некогда называлось сквером,{/i}"
    "{i}и я взглянул вправо, на огромное здание с колоннами. Когда‑то белое, оно посерело от грязи и потеряло часть штукатурки,{/i}"
    "{i}а черная с золотом надпись на фронтоне настолько выцвела, что я с трудом разобрал слова: «Тайный орден Дагона».{/i}"


label chapter_2:

    define n = Character(None, kind=nvl, window_left_padding=-100, window_yoffset=40)

    scene bg6

    n "{i}И вдруг все мысли о времени бесследно исчезли под натиском явившегося мне видения, причем я исполнился необъяснимого ужаса еще до того,{/i}"
    n "{i}как понял, что такое в самом деле вижу.{/i}"

    hide text

    scene bg21

    "{i}Дверь, открытая в церковный полуподвал, вырисовывалась прямоугольником мрака.{/i}"
    "{i}И там я увидел субъекта, который пересек – или казалось, что пересек, – этот темный прямоугольник.{/i}"
    "{i}Видение казалось тем более жутким и сводящим с ума, что здравый рассудок отрицал наличие в нем чего‑либо кошмарного.{/i}"

    define n = Character(None, kind=nvl, window_left_padding=-100, window_yoffset=40)

    scene bg6

    n "{i}Так вот что подействовало на мое воображение и придало зловещий вид в остальном лишь смутно различимой, прошаркавшей внизу фигуре!{/i}"
    n "{i}Нет никаких оснований, тотчас подумал я, испытывать ужас от этого мрачного псевдовоспоминания.{/i}"

    hide text

    scene bg23

    "{i}Проехав мост, мы оказались на огромной полукруглой площади и свернули направо, прямо к высокому зданию с куполом,{/i}"
    "{i}остатками желтой краски на стенах и полустершейся вывеской, из которой следовало, что это и есть «Гилмэн‑хаус».{/i}"
    "{i}Радуясь концу поездки, я покинул автобус и зашел в отель, чтобы оставить там свой багаж.{/i}"

    scene bg22

    "{i}Холл, убранство которого не было столь ужасным, как изначально представлялось, тоже оказался совершенно пустым, без каких либо признаков жизни.{/i}"
    "{i}Вместо того, чтобы искать и ррасспрашивать постояльцев отеля я вышел на площадь, откуда автобус уже уехал, и внимательно осмотрелся.{/i}"

    scene bg24

    "{i}Здания в этой части города находились в приличном состоянии и включали не менее дюжины торговых заведений.{/i}"
    "{i}Я приметил бакалею Первой национальной торговой сети, мрачноватый ресторан, аптеку и офис оптовой рыботорговли,{/i}"
    "{i}а также контору единственного промышленного предприятия города, «Марш рефайнинг компани», на восточной стороне площади, ближе к реке.{/i}"
    "{i}Было ясно, что я нахожусь в городском административном центре. На востоке глаз мой уловил голубые проблески гавани,{/i}"
    "{i}напротив которой поднимались жалкие развалины трех некогда прекрасных колоколен георгианского стиля.{/i}"
    "{i}А на другом берегу реки белела башня, венчающая то, что являлось, по всей вероятности, фабрикой Марша.{/i}"

    scene bg25

    "{i}Так или иначе, но я выбрал человека, которому счел возможным задать свои вопросы, и в первую очередь потому,{/i}"
    "{i}что наружность его не имела ничего общего с внешностью коренных жителей Инсмута.{/i}"
    "{i}Это был одиноко торчавший за стойкой бакалеи паренек лет примерно семнадцати.{/i}"
    "{i}Я сразу отметил его смышленость и приветливость, обещавшие получение качественной информации.{/i}"
    "{i}Он, похоже, и сам был не прочь поговорить; видно, перемолвиться словом с кем‑то приезжим было для него удовольствием.{/i}"

    image insm_4_1 = im.Scale("insm_4.png", 1080 / 1.6, 1920 / 1.6)
    image insm_4 = im.Scale("insm_4_1.png", 1080 / 1.6, 1920 / 1.6)

    image insm_10 = im.Scale("insm_10.png", 1080 / 1.7, 1920 / 1.7)
    image insm_10_2 = im.Scale("insm_10_2.png", 1080 / 1.7, 1920 / 1.7)



    define b = Character("Бакалейщик", color="#0B888E")
    define g = Character("Роберт Олмстед", color="#0B888E")

    show insm_4 at center
    voice "audio/voices/grocer/grocer1.mp3"
    b "{i}Я родом из Аркхема, но сейчас нахожусь в Инсмуте, столовлюсь с семейством, переехавшим из Ипсвича, и при первой же возможности намерен вернуться домой.{/i}"


    show insm_4_1 at center
    voice "audio/voices/grocer/grocer2.mp3"
    b "{i}Мои близкие не одобряли мою работу в Инсмуте, но фирма, которой принадлежит магазин, направила меня сюда, и я не хочу терять это место.{/i}"

    show insm_4 at center
    voice "audio/voices/grocer/grocer3.mp3"
    b "{i}Здесь, в Инсмуте, нет ни общественной библиотеки, ни торговой палаты, но здесь есть кое-какие достопримечательности.{/i}"
    
    voice "audio/voices/grocer/grocer4.mp3"
    b "{i}Улица, по которой я прибыл, называется Федеральной.{/i}"
    
    voice "audio/voices/grocer/grocer5.mp3"
    b "{i}Западнее расположены старые жилые кварталы с некогда роскошными особняками – Броуд‑, Вашингтон‑, Лафайет‑ и Адамс‑стрит, а восточнее – береговые трущобы.{/i}"
    
    voice "audio/voices/grocer/grocer6.mp3"
    b "{i}Среди трущоб вдоль Мейн‑стрит можно осмотреть георгианские церкви, хотя они все давно заброшены.{/i}"

    show insm_4_1 at center
    voice "audio/voices/grocer/grocer7.mp3"
    b "{i}Но стоит знать, что в тех местах – особенно севернее реки – небезопасно проявлять любопытство, так как местные жители озлоблены и враждебны.{/i}"

    show insm_4 at center
    voice "audio/voices/grocer/grocer8.mp3"
    b "{i}Нескольких приезжих даже недосчитались. Они просто исчезли, и все. Иные места – что-то вроде запретных зон, по моим словам.{/i}"
    
    voice "audio/voices/grocer/grocer9.mp3"
    b "{i}К примеру, я не рекомендовал бы долго задерживаться у фабрики Марша и некоторых все еще действующих церквей, особенно возле здания с колоннами, что на Нью‑Чёрч‑Грин,{/i}"
    
    voice "audio/voices/grocer/grocer10.mp3"
    b "{i}где помещается Орден Дагона. С церквями вообще дело нечисто – все местные отреклись от традиционных религий, и в ходу у них невероятные обряды и ритуальные облачения.{/i}"
    
    voice "audio/voices/grocer/grocer11.mp3"
    b "{i}Их вера содержит в себе намеки на какие-то чудесные перевоплощения, ведущие к телесному бессмертию – или чему-то вроде того – на этой земле.{/i}"

    show insm_4_1 at center
    voice "audio/voices/grocer/grocer12.mp3"
    b "{i}Духовник этого юноши – доктор Уоллес, пастор методистской церкви Эсбери в Аркхеме – настоятельно советовал бы мне держаться подальше от церквей Инсмута.{i}"

    scene bg25

    show insm_4 at right
    show insm_10 at left
    voice "audio/voices/Robert/robert1.mp3"
    g "{i}Что не так с этими инсмуцами, каждый встретившийся человек смотрит на искоса, так как будто я лишний в этом городе?{/i}"

    voice "audio/voices/grocer/grocer13.mp3"
    b "{i}Касательно же инсмутцев, я едва ли знал и мог объяснить, что с ними сделалось.{/i}"

    voice "audio/voices/grocer/grocer14.mp3"
    b "{i}Они скрытны, редко показываются на глаза – совсем как звери, живущие в норах; кто знает, как они проводят время, свободное от рыбной ловли.{/i}"
    
    voice "audio/voices/grocer/grocer15.mp3"
    b "{i}Возможно – судя по количеству потребляемого ими контрабандного спиртного – большую часть дневного времени они валяются в алкогольном ступоре.{/i}"

    scene bg25

    show insm_4_1 at right
    show insm_10_2 at left
    voice "audio/voices/grocer/grocer16.mp3"
    b "{i}Они, кажется, объединены в своего рода замкнутое товарищество, презирающее мир, будто они одни имеют доступ к иным, более предпочтительным сферам бытия.{/i}"
    
    voice "audio/voices/grocer/grocer17.mp3"
    b "{i}Их внешность – особенно эти немигающие глаза, которых они, кажется, никогда не закрывают, – не может не шокировать посторонних; а голоса их просто омерзительны.{/i}"
    
    voice "audio/voices/grocer/grocer18.mp3"
    b "{i}Жутко слышать по ночам эти их песнопения в церквах, особенно во время их главных празднеств, которые проводятся дважды в год – тридцатого апреля и тридцать первого октября.{/i}"
    
    voice "audio/voices/grocer/grocer19.mp3"
    b "{i}Известна их любовь к воде, они способны подолгу плавать в реке или гавани. Нередко они устраивают массовые заплывы аж до Чертова рифа, а это под силу лишь очень хорошим пловцам.{/i}"
    
    voice "audio/voices/grocer/grocer20.mp3"
    b "{i}Нельзя было не заметить, что на публике показывались в основном молодые люди, а старшие не особенно стремились к этому, поскольку выглядели гораздо уродливее.{/i}"
    
    voice "audio/voices/grocer/grocer21.mp3"
    b "{i}Исключение составляли те, что не имели сильных отклонений от нормы, как, например, старик портье в отеле.{/i}"

    scene bg25

    show insm_4 at right
    show insm_10 at left

    b "{i}Можно только гадать, что случилось с большинством старшего населения и не является ли пресловутый «инсмутский вид» следствием какого‑то особого, прогрессирующего с годами недуга.{/i}"
    b "{i}Редко какая болезнь способна произвести по мере взросления такие обширные и радикальные анатомические перемены, включая деформацию костей и черепа.{/i}"
    b "{i}При таких изменениях во внешности, оставалось лишь гадать, как меняется в результате болезни организм человека в целом.{/i}"

    show insm_4_1 at right

    b "{i}Весьма затруднительно, заключил я, сформулировать какие‑либо реальные выводы, поскольку никто из приезжих не может похвастаться близким знакомством с кем‑то из местных независимо от того,{/i}"
    b "{i}как долго он прожил в Инсмуте. Я не сомневался, что в этом городе обитают субъекты, гораздо страшнее тех, что периодически появляются на улицах.{/i}"
    b "{i}Я уверен, что они удерживают самых ужасных из них в уединении. Местные жители иногда слышат странные звуки и предполагают,{/i}"
    scene bg25

    show insm_10 at left
    show insm_4 at right

    b "{i}что старые развалины на северном берегу скрыты потайными туннелями, создавая пристанище для чудовищных тварей.{/i}"
    b "{i}Никто не знает, какая чужеродная кровь течет в их жилах, если вообще это чья-то кровь.{/i}"

    scene bg25

    show insm_10 at left
    show insm_4_1 at right

    b "{i}Они стремятся укрыть самых отвратительных из своих сородичей от внешнего мира и государственного контроля.{/i}"
    b "{i}Советую вам не допытывать местных обитателей этого города.{/i}"
    b "{i}Единственный, кто может рассказать что-то ценное, – это старик по имени Зейдок Аллен, ведущий затворническую жизнь в богадельне на северном краю города.{/i}"

    show insm_4 at right

    b "{i}Ему девяносто шесть лет, и он известен как пьяница, постоянно оглядывающийся через плечо, будто бы всегда встревоженный чем-то.{/i}"

    scene bg25

    show insm_10_2 at left
    show insm_4_1 at right

    b "{i}Трезвым он не общается с приезжими, но после пары глотков предпочтительного напитка он открывает шкатулку своих потрясающих историй о городе.{/i}"

    g "{i}Вы, как я понимаю, в полной мере прониклись мистикой данного городка?{i}"

    b "{i}Все же мои догадки имеют место быть... Кстати, вот вам карта, я ей пользовался как только приехал в город, улицы тут запутанные, и этого не отнять...{/i}"

    scene bg25

    show insm_10 at left
    show insm_4 at right

    b "{i}Не желаете приобрести местное виски? Да, возможно, город и переживает смутные времена, но джин, ничуть не потерял своей изысканности?{/i}"

    menu:
        "{i}Приобрести виски{/i}":
            jump whiskey
        "{i}Отказаться от виски{/i}":
            jump no_whiskey
